In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv("https://raw.githubusercontent.com/benesom/redi-da-cph-fall21/master/lesson02/exercises_and_homework/legosets.csv")

In [3]:
df.head()

  set_num                        name  year  theme_id  num_parts
0    00-1             Weetabix Castle  1970       414        471
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          2
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [12]:
all_piecies = ["num_parts"]
df[all_piecies].sum()
#total number of piecies are 1894089

num_parts    1894089
dtype: int64

In [5]:
df.max

<bound method NDFrame._add_numeric_operations.<locals>.max of              set_num                                               name  year  \
0               00-1                                    Weetabix Castle  1970
1             0011-2                                  Town Mini-Figures  1978
2             0011-3                         Castle 2 for 1 Bonus Offer  1987
3             0012-1                                 Space Mini-Figures  1979
4             0013-1                                 Space Mini-Figures  1979
...              ...                                                ...   ...
11668    Wauwatosa-1  LEGO Store Grand Opening Exclusive Set, Mayfai...  2012
11669   WHITEHOUSE-1                                  Micro White House  2015
11670    Wiesbaden-1  LEGO Store Grand Opening Exclusive Set, Wiesba...  2010
11671  WishingWell-1                     Wishing Well [Toys R Us Promo]  2013
11672        wwgp1-1                Wild West Limited Edition Gift Pack  1996

       theme_id  num_parts
0           414        471
1            84         12
2           199          2
3           143         12
4           143         12
...         ...        ...
11668       408         15
11669       598         59
11670       408        146
11671       494         28
11672       476          3

[11673 rows x 5 columns]>

In [6]:
df_numeric = df.set_index("year").select_dtypes("number")
df_numeric.head()

      theme_id  num_parts
year
1970       414        471
1978        84         12
1987       199          2
1979       143         12
1979       143         12

In [7]:
df_numeric["num_parts"].idxmax()
#highest number of sets released in year 2008

2008

In [8]:
df_numeric["num_parts"][2008]

year
2008    2017
2008    2358
2008    1084
2008    1625
2008    3807
        ...
2008       0
2008       0
2008     215
2008      79
2008      29
Name: num_parts, Length: 349, dtype: int64

In [9]:
df_numeric["num_parts"].mean(axis="index")

162.26240041120533

In [10]:
round(162.26240041120533,1)
#average_pieces=162.3

162.3

In [11]:
df.name.value_counts()
#basic building set is most used word in coloumn name

Basic Building Set                                  55
Universal Building Set                              32
Helicopter                                          23
Basic Set                                           23
Tow Truck                                           14
                                                    ..
Obi-Wan Kenobiâ„¢                                      1
Advent Calendar 1998 Classic Basic (Day  3) Boat     1
Plates, Blue                                         1
Meteor Strike                                        1
Super Glider (Kabaya Promotional)                    1
Name: name, Length: 10370, dtype: int64